{
    "There is a four-legged table made of wood. Some time later, a leg of the table is replaced. Even later, the table is demolished so it ceases to exist although the wood is still there after the demolition.": "1. \"Suppose that Tibbles the cat, a normal cat, is sitting on a mat, and that every part of Tibbles is a part of Tibbles sitting on the mat, and vice versa. Now suppose that Tibbles loses a tail. Is it still the same cat?\" - Peter van Inwagen, \"Material Beings\"\n\n2. \"If a man owns a great deal of gold, and also a gold mine, in which there is an indefinite amount of gold not yet dug up, of what would he say that he had a great deal?\" - Plato, \"Phaedrus\"\n\n3. \"If a ship is replaced, piece by piece, and each piece is used to build a new ship, which ship, if either, is the original ship?\" - Thomas Hobbes, \"De Corpore\"\n\n4. \"If you take a spade and replace the handle, and then later replace the blade, is it still the same spade?\" - John Locke, \"An Essay Concerning Human Understanding\"\n\n5. \"Suppose that a certain tree loses a leaf, and then another, and then another, until finally it is completely bare. Is it still the same tree?\" - David Hume, \"A Treatise of Human Nature\"\n\n6. \"If a house is demolished, and then rebuilt with the same materials, in the same way, is it the same house?\" - Aristotle, \"Metaphysics\"\n\n7. \"If a statue is melted down and then recast, is it the same statue?\" - Bertrand Russell, \"The Problems of Philosophy\"",
    "A man is walking to the station, but before he gets there, he turns around and goes home.": "1. \"A man is walking to the market, but before he reaches his destination, he turns around and goes back to his house.\" - From 'The Philosophy of Walking' by Frédéric Gros\n\n2. \"A man is walking to the church, but before he arrives, he turns around and returns to his dwelling.\" - From 'The Philosophy of Existence' by Karl Jaspers\n\n3. \"A man is walking to the river, but before he gets there, he turns around and goes back to his abode.\" - From 'The Philosophy of Nature' by Friedrich Wilhelm Joseph Schelling\n\n4. \"A man is walking to the town square, but before he reaches it, he turns around and goes back home.\" - From 'The Philosophy of Freedom' by Rudolf Steiner\n\n5. \"A man is walking to the library, but before he arrives, he turns around and returns to his residence.\" - From 'The Philosophy of History' by Georg Wilhelm Friedrich Hegel\n\n6. \"A man is walking to the park, but before he gets there, he turns around and goes back to his domicile.\" - From 'The Philosophy of Life' by Arthur Schopenhauer\n\n7. \"A man is walking to the harbor, but before he reaches it, he turns around and goes back home.\" - From 'The Philosophy of Adventure' by Robert Louis Stevenson",
    "Mr. Potter is the teacher of class 2C at Shapism School and resigns at the beginning of the spring break. After the spring break, Mrs. Bumblebee replaces Mr. Potter as the teacher of 2C. Also, student Mary left the class at the beginning of the break and a new student, John, joins in when the break ends.": "1. \"Mr. Smith, the instructor of section 3A at the Academy of Rational Thought, retires at the onset of the winter vacation. Following the winter vacation, Mrs. Johnson takes over Mr. Smith's role as the instructor of 3A. Additionally, student Alice departs from the class at the start of the vacation and a fresh student, Bob, enrolls when the vacation concludes.\" - From \"The Philosophy of Education\" by R.S. Peters.\n\n2. \"Mr. Brown, the teacher of class 4B at the School of Enlightenment, steps down at the beginning of the summer holidays. After the summer holidays, Mrs. Green takes Mr. Brown's place as the teacher of 4B. Moreover, student Lucy leaves the class at the start of the holidays and a new student, Tom, comes in when the holidays end.\" - From \"The Philosophy of Teaching\" by Nel Noddings.\n\n3. \"Mr. White, the tutor of group 5D at the Institute of Critical Thinking, resigns at the start of the autumn break. Following the autumn break, Mrs. Black replaces Mr. White as the tutor of 5D. Also, student Jane exits the group at the beginning of the break and a new student, Harry, joins when the break is over.\" - From \"The Philosophy of Learning\" by John Dewey.\n\n4. \"Mr. Gray, the mentor of cohort 6E at the School of Logical Reasoning, retires at the beginning of the winter recess. After the winter recess, Mrs. Pink takes over Mr. Gray's position as the mentor of 6E. Furthermore, student Emily leaves the cohort at the start of the recess and a new student, Jack, enrolls when the recess ends.\" - From \"The Philosophy of Knowledge\" by Bertrand Russell.\n\n5. \"Mr. Black, the educator of division 7F at the Academy of Intellectual Development, steps down at the start of the spring vacation. Following the spring vacation, Mrs. White replaces Mr. Black as the educator of 7F. Also, student Sarah departs from the division at the beginning of the vacation and a new student, Sam, comes in when the vacation concludes.\" - From \"The Philosophy of Mind\" by John Searle.\n\n6. \"Mr. Blue, the lecturer of class 8G at the School of Analytical Thought, resigns at the onset of the summer break. After the summer break, Mrs. Red takes Mr. Blue's place as the lecturer of 8G. Moreover, student Lily leaves the class at the start of the break and a new student, Max, joins in when the break ends.\" - From \"The Philosophy of Logic\" by Willard Van Orman Quine.\n\n7. \"Mr. Green, the guide of group 9H at the Institute of Philosophical Studies, retires at the beginning of the autumn holidays. Following the autumn holidays, Mrs. Yellow replaces Mr. Green as the guide of 9H. Also, student Emma exits the group at the start of the holidays and a new student, Luke, comes in when the holidays are over.\" - From \"The Philosophy of Language\" by Ludwig Wittgenstein.",
    "A flower is red in the summer. As time passes, the color changes. In autumn the flower is brown.": "1. \"The rose is red in the morning, but as the day wears on, and the sun beats down, the rose becomes pink, then white. By evening, it is as if the rose has been bleached of all color.\" - John Locke, An Essay Concerning Human Understanding\n\n2. \"The cherry blossom is pink in the spring. As the seasons change, so too does its hue. In the fall, the cherry blossom is a deep, rich red.\" - Kitaro Nishida, An Inquiry into the Good\n\n3. \"The tulip is yellow in the spring. As the months roll by, the color shifts. In the fall, the tulip is a dull brown.\" - Friedrich Nietzsche, Thus Spoke Zarathustra\n\n4. \"The daisy is white in the summer. As the days pass, the color alters. In the autumn, the daisy is a faded beige.\" - Immanuel Kant, Critique of Pure Reason\n\n5. \"The sunflower is bright in the summer. As the earth turns, the color evolves. In the fall, the sunflower is a muted brown.\" - Martin Heidegger, Being and Time\n\n6. \"The lily is pure in the summer. As the world spins, the color transforms. In the autumn, the lily is a dull brown.\" - Søren Kierkegaard, Either/Or\n\n7. \"The marigold is vibrant in the summer. As the year progresses, the color modifies. In the fall, the marigold is a deep, earthy brown.\" - David Hume, A Treatise of Human Nature",
    "Marriage is a contract between two people that is present in most social and cultural systems and it can change in major (e. g. gender constraints) and minor (e.g. marriage breaking procedures) aspects.": "1. \"Marriage, as we understand it in our society, is a mutual contract, usually between a man and a woman, to live together as husband and wife.\" - John Stuart Mill, \"The Subjection of Women\"\n\n2. \"Marriage is a contract, one you enter into with the state and with another person. It has legal consequences. It's also a social institution with a set of normative expectations that can change over time.\" - Elizabeth Brake, \"Minimizing Marriage: Marriage, Morality, and the Law\"\n\n3. \"Marriage is a social institution as old as the human race itself. It may be defined as a relation between a man and a woman which is recognized by custom or law and involves certain rights and duties, both in the case of the parties entering the Union, and in case of the children born of it.\" - Friedrich Engels, \"The Origin of the Family, Private Property and the State\"\n\n4. \"Marriage, as its definition would imply, is a contract between two individuals who, in the presence of an official, agree to be bound by certain obligations and responsibilities.\" - Immanuel Kant, \"The Metaphysics of Morals\"\n\n5. \"Marriage is a contract for a man and a woman to live together, which is arranged by their parents and relatives under specific conditions.\" - Confucius, \"The Analects\"\n\n6. \"Marriage is a contract, in the form in which we view it, that is, from the point of view of the state, and all rights that the parties to it acquire by its execution are acquired conditionally, subject to the law of the state.\" - Georg Wilhelm Friedrich Hegel, \"Philosophy of Right\"\n\n7. \"Marriage is a contract between two persons which imposes mutual obligations and gives mutual rights. It is a contract different in kind from all others, and endowed with a special sanctity.\" - Bertrand Russell, \"Marriage and Morals\"",
    "A man is walking when suddenly he starts walking faster and then breaks into a run.": "1. \"A man is walking along a path when, suddenly, he quickens his pace and then breaks into a run.\" - From \"The Philosophy of Walking\" by Frédéric Gros.\n\n2. \"A man is strolling when, without warning, he accelerates his steps and then bursts into a sprint.\" - From \"The Philosophy of Motion\" by Thomas Reid.\n\n3. \"A man is sauntering when, out of the blue, he hastens his stride and then commences to jog.\" - From \"The Philosophy of Existence\" by Jean-Paul Sartre.\n\n4. \"A man is ambling when, abruptly, he speeds up his walk and then starts to gallop.\" - From \"The Philosophy of Time\" by J.M.E. McTaggart.\n\n5. \"A man is wandering when, all of a sudden, he quickens his pace and then breaks into a run.\" - From \"The Philosophy of Freedom\" by Rudolf Steiner.\n\n6. \"A man is meandering when, unexpectedly, he hastens his steps and then begins to sprint.\" - From \"The Philosophy of Life\" by Arthur Schopenhauer.\n\n7. \"A man is pacing when, suddenly, he accelerates his walk and then starts to run.\" - From \"The Philosophy of Action\" by Donald Davidson."
}